//=============================================================================
//
// リザルト画面処理 [result.h]
//
//=============================================================================
#pragma once

#include "main.h"
#include "game.h"
#include "renderer.h"
#include "sprite.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct TUTORIAL
{
	XMFLOAT3	pos;		// ポリゴンの座標
	float		w, h;		// 幅と高さ

	float		scrl;		// スクロール
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);


